In [1]:
import pandas as pd
import numpy as np
import random

* # Series is just single column of data

In [2]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [3]:
import string

In [4]:
alphalist = list(string.ascii_uppercase)
print(alphalist)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [5]:
index1 = [alphalist[i] for i in range(10)]
index1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [6]:
series1 = pd.Series(data = data1, index = index1)

In [7]:
series1

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [8]:
dico = {k:v for k,v in zip(index1,data1)}

In [9]:
series2 = pd.Series(dico)
series2

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [10]:
df = pd.DataFrame(np.random.randn(5,5), index = 'A/B/C/D/E'.split('/'), columns = 'V/W/X/Y/Z'.split("/"))
df

          V         W         X         Y         Z
A -0.245681 -0.149769  0.953707 -0.453921  0.625827
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281
C  1.437332 -1.388466  0.385773 -0.704771 -0.522076
D -0.693832  0.459937  0.374370  0.658910 -0.850656
E -1.878883 -1.927642 -0.293436  0.395478 -0.708160

In [11]:
df['V']

A   -0.245681
B   -1.361143
C    1.437332
D   -0.693832
E   -1.878883
Name: V, dtype: float64

In [12]:
# Selectin Columns
df[['V','X']]

          V         X
A -0.245681  0.953707
B -1.361143 -1.577839
C  1.437332  0.385773
D -0.693832  0.374370
E -1.878883 -0.293436

In [13]:
df[['W','Y']]

          W         Y
A -0.149769 -0.453921
B -0.142772 -1.248828
C -1.388466 -0.704771
D  0.459937  0.658910
E -1.927642  0.395478

In [14]:
# We use iloc to select a particular row
df.iloc[0]

V   -0.245681
W   -0.149769
X    0.953707
Y   -0.453921
Z    0.625827
Name: A, dtype: float64

In [15]:
# loc for name of the row, iloc for the integer location(position) of the row
df.loc['B']['V']

-1.3611429062501343

In [16]:
df[df['Z']> 0]

          V         W         X         Y         Z
A -0.245681 -0.149769  0.953707 -0.453921  0.625827
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281

In [17]:
df['U'] = df['V']+ df['Z'] # adding new column to the dataframe

In [18]:
df

          V         W         X         Y         Z         U
A -0.245681 -0.149769  0.953707 -0.453921  0.625827  0.380145
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281 -0.357862
C  1.437332 -1.388466  0.385773 -0.704771 -0.522076  0.915256
D -0.693832  0.459937  0.374370  0.658910 -0.850656 -1.544488
E -1.878883 -1.927642 -0.293436  0.395478 -0.708160 -2.587043

In [19]:
df[df['U'] > df['V']]

          V         W         X         Y         Z         U
A -0.245681 -0.149769  0.953707 -0.453921  0.625827  0.380145
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281 -0.357862

In [20]:
df.loc['D'][['Z','X']]

Z   -0.850656
X    0.374370
Name: D, dtype: float64

In [21]:
df[['X','Z']].loc['D']

X    0.374370
Z   -0.850656
Name: D, dtype: float64

In [22]:
df.head() #First 5

          V         W         X         Y         Z         U
A -0.245681 -0.149769  0.953707 -0.453921  0.625827  0.380145
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281 -0.357862
C  1.437332 -1.388466  0.385773 -0.704771 -0.522076  0.915256
D -0.693832  0.459937  0.374370  0.658910 -0.850656 -1.544488
E -1.878883 -1.927642 -0.293436  0.395478 -0.708160 -2.587043

In [23]:
df.tail() #Last 5

          V         W         X         Y         Z         U
A -0.245681 -0.149769  0.953707 -0.453921  0.625827  0.380145
B -1.361143 -0.142772 -1.577839 -1.248828  1.003281 -0.357862
C  1.437332 -1.388466  0.385773 -0.704771 -0.522076  0.915256
D -0.693832  0.459937  0.374370  0.658910 -0.850656 -1.544488
E -1.878883 -1.927642 -0.293436  0.395478 -0.708160 -2.587043

# Concatinate

In [24]:
import pandas as pd

In [25]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['C0','C1','C2','C3'],
                   'C':['C0','C1','C2','C3']},index =[0,1,2,3])
df2 = pd.DataFrame({'D':['D4','D5','D6','D7']},index = [4,5,6,7])

In [26]:
pd.concat([df1,df2],axis =1)

     A    B    C    D
0   A0   C0   C0  NaN
1   A1   C1   C1  NaN
2   A2   C2   C2  NaN
3   A3   C3   C3  NaN
4  NaN  NaN  NaN   D4
5  NaN  NaN  NaN   D5
6  NaN  NaN  NaN   D6
7  NaN  NaN  NaN   D7

# Merging and joining DataFrame

In [27]:
left = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'A': ['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                      'C': ['C0','C1','C2','C3'],
                      'D': ['D0','D1','D2','D3'

In [28]:
pd.merge(left,right,how='inner' ,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [42]:
left = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']}, 
index=['K0','K1','K2','K3'])
    
right = pd.DataFrame({'C': ['C0','C1','C2','C3'],
                      'D': ['D0','D1','D2','D3']}, 
index=['K0','K1','K2','K3'])

In [45]:
display(left,right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [43]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [47]:
left = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'A': ['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                      'C': ['C0','C1','C2','C3'],
                      'D': ['D0','D1','D2','D3']})

In [51]:
pd.merge(left,right,how='inner',on ='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [53]:
df_out = pd.merge(left,right, on)

NameError: name 'on' is not defined

In [58]:
left = pd.DataFrame({'key1': ['K0','K0','K1','K2'],
                    'key2': ['K0','K1','K0','K1'],
                     'A': ['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']})
right = pd.DataFrame({'key1': ['K0','K1','K1','K2'],
                      'key2' : ['K0','K0','K0','K0'],
                      'C': ['C0','C1','C2','C3'],
                      'D': ['D0','D1','D2','D3']})

In [59]:
pd.merge(left,right)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2